
 main: proc options(main);
 %include net;

   dcl conn like conncb;
   dcl hostname char(256) varying init('www.example.com');

   on condition(neterror) begin;
     put skip list('Resolution failed, errno =', oncode());
     stop;
   end;

   call netnew(conn, AF.INET, TYPE.STREAM, 0);
   call netresolve(conn, hostname);

   put skip list('Resolved', hostname, 'to', trim(conn._host));

 end;